// src/components/TattooCare.jsx
import React from 'react';
import { Container, Row, Col, Card } from 'react-bootstrap';
import ContactButton from './ContactButton';

const TattooCare = () => {
    return (
        <Container className="mt-5">
            <h1 className="text-center mb-4">Догляд за тату</h1>
            <Row className="justify-content-center">
                <Col xs={12} sm={10} md={8} lg={6}>
                    <Card>
                        <Card.Body>
                            <Card.Title className="text-center">Вітаю з новим татуюванням</Card.Title>
                            <Card.Text>
                                <p>Сподіваюся, мені вдалося зробити все так, як ти мріяв/мріяла! Дякую, що обрала мене.</p>
                                <p>Правильний догляд під час загоєння не менш важливий, ніж і сам процес нанесення тату.</p>
                                <h5>Плівка для загоєння</h5>
                                <ul>
                                    <li>Швидше за все я наклеїла тобі плівку, основне твоє завдання берегти її 3-4 дні. Плівка захищає тату і водночас імітує верхній шар шкіри. Весь основний процес загоєння проходить під нею, і нічого додатково робити не потрібно.</li>
                                    <li>З плівкою можна спокійно приймати душ, але варто утриматися від гарячої ванни, спорту та всього, що змушує тебе потіти.</li>
                                    <li>Поки плівка на шкірі під нею може накопичуватися невелика кількість лімфи та пігменту - це нормально. Коли ти знімеш її, все зайве змиється.</li>
                                    <li>Іноді плівка може задиратися, погано триматися, особливо у спеку. Якщо плівка задерлася, але тату все ще під плівкою, все ок можна навіть зрізати цей куточок; але якщо тату видно - знімай плівку незалежно від дня і не клей її назад, далі дій як описано нижче та напиши мені.</li>
                                    <li>На період з плівкою утримайся від алкоголю.</li>
                                </ul>
                                <h5>Зняття плівки</h5>
                                <ul>
                                    <li>На 3-4 день або коли плівка знялася сама акуратно зніми плівку.</li>
                                    <li>Промийте тату водою з милом, можна протерти хлоргексидином. Витирай тату сухими серветками, щоб вона залишалася чистою. Далі використовуй крем Бепантен, він чудово підходить для загоєння.</li>
                                    <li>Перший час використовуй крем кілька разів на день, від двох. Щодня промивай тату, особливо після вулиці. Важливо, щоб вона залишалася в чистоті, не піддавалася тертю, а шкіра не була сухою.</li>
                                    <li>Не три, не чеши тату) Знаю, іноді дуже хочеться, але не треба)) Краще помаж ще кремом.</li>
                                    <li>Після зняття плівки також утримайся на два тижні від зали, басейну, сауни, відкритої води та засмаги.</li>
                                </ul>
                                <h5>Пам'ятай:</h5>
                                <ul>
                                    <li>На місці тату не можна робити лазерну епіляцію, навіть маленький дотик може призвести до опіку.</li>
                                    <li>Обов'язково захищай тату від сонячних променів SPF.</li>
                                    <li>І не забудь надіслати мені фото після загоєння.</li>
                                    <li>Якщо у тебе є якісь питання, сумніви, напиши мені і я з радістю відповім тобі.</li>
                                </ul>
                            </Card.Text>
                            <div className="text-center mt-4">
                                <ContactButton />
                            </div>
                        </Card.Body>
                    </Card>
                </Col>
            </Row>
        </Container>
    );
};

export default TattooCare;
